app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."open" = $1  [["open", "t"]]
---
  def list
    @course=Course.all
    @course=@course.where(open:true).all