app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)
    get_course_code
    if @course.save
      course_code = get_course_code
      @course.update_attributes({"course_code"=>course_code})
      current_user.teaching_courses<<@course
---
INSERT INTO "courses" ("course_code", "name", "course_department", "course_firstlevel", "teaching_object", "course_type", "credit", "period", "limit_num", "start_week", "end_week", "course_time", "campus", "building", "class_room", "teaching_type", "exam_type", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"
INSERT INTO "users" ("name", "email", "num", "major", "department", "password_digest", "admin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def edit

    @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @course = Course.find_by_id(params[:id])
    get_course_code
    if @course.update_attributes(course_params)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "courses" SET "course_code" = $1, "course_department" = $2, "course_firstlevel" = $3, "credit" = $4, "updated_at" = $5 WHERE "courses"."id" = $6  [["course_code", "091M1102H"], ["course_department", "数学科学学院"], ["course_firstlevel", "数学"], ["credit", 0.5], ["updated_at", "2017-01-04 13:10:24.219704"], ["id", 2]]

  def destroy
    @course=Course.find_by_id(params[:id])
    current_user.teaching_courses.delete(@course)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 1]]

  def open
    @course=Course.find_by_id(params[:id])
    @course.update_attribute(:open,true)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "courses" SET "open" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["open", "t"], ["updated_at", "2016-12-25 08:22:20.740845"], ["id", 1]]

  def close
    @course=Course.find_by_id(params[:id])
    @course.update_attribute(:open,false)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "courses" SET "open" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["open", "f"], ["updated_at", "2016-12-21 14:31:02.911555"], ["id", 1]]

  def list
    @course = Course.all
---
SELECT "courses".* FROM "courses"

  def filter
    #byebug
    $SelectedCourses = current_user.courses
    str = params[:exchange]                     #获取筛选字符串
    unless str.nil?
      Filter.filter(str, Course.all)            #执行筛选操作
---
SELECT "courses".* FROM "courses"

  def select
    @course=Course.find_by_id(params[:id])
    course_time=CourseTime.new @course
    @@conflict_list=course_time.DectConflictByList(current_user.courses)
    if @@conflict_list.empty?
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 6]]

  def quit
    @course=Course.find_by(id:params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]

  def detail

    @course=Course.find_by(id:params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]