app/controllers/users_controller.rb

  def edit
    @user=User.find_by_id(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 6]]

  def update
    @user = User.find_by_id(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 6]]

  def edit_password
    @user = User.find_by_id(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]

  def update_password
    @user = User.find_by_id(params[:id])
    if @user.authenticate(params.require(:user).permit(:old_password)[:old_password])
      if user_pwd_params[:password] != user_pwd_params[:password_confirmation]
        flash={:warning => "修改失败：两次密码输入不一致"}
      elsif @user.update_attributes(user_pwd_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$IK9km7QKu9q3QdJUaTpeFeyk506GqYFSt99Brnyed6p5Xtt9AiOnC"], ["updated_at", "2017-01-06 06:48:59.644529"], ["id", 2]]